# GetCurveLoops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents..::..GetCurveLoops Method
RoofComponents Class See Also
---
The CurveLoops of roof slabs.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<CurveLoop> GetCurveLoops()
```

Visual Basic
---
```text
Public Function GetCurveLoops As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetCurveLoops()
```

# ### Return Value
The CurveLoops.
# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace